NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_application.svd
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORFLAGS</name>
                <description>These bits indicate an error condition.</description>
                <lsb>4</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PKBUSY</name>
                <description>This bit reflects the BUSY output value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INTRPTSTATUS</name>
                <description>This bit reflects the IRQ output value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FAILPTR</name>
                <description>These bits indicate which data location generated the error flag.</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMER</name>
            <description>Timer register.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMER</name>
                <description>Number of clock cycles (as the number of core cycles is always even, register bit 0 is tied to zero).</description>
                <lsb>1</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>Hardware configuration register.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x01F30200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXOPSIZE</name>
                <description>Maximum operand size (number of bytes).</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NBMULT</name>
                <description>Number of multipliers:</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MULT1</name>
                    <description>1 multiplier</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT4</name>
                    <description>4 multipliers</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT16</name>
                    <description>16 multipliers</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT64</name>
                    <description>64 multipliers</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT256</name>
                    <description>256 multipliers</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRIMEFIELD</name>
                <description>Support prime field.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BINARYFIELD</name>
                <description>Support binary field.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATAMEMECC</name>
                <description>Support data memory error correction.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CODEMEMECC</name>
                <description>Support code memory error correction.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P256</name>
                <description>Support ECC P256 acceleration.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P384</name>
                <description>Support ECC P384 acceleration.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P521</name>
                <description>Support ECC P521 acceleration.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P192</name>
                <description>Support ECC P192 acceleration.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>X25519</name>
                <description>Support Curve25519/Ed25519 acceleration.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AHBMASTER</name>
                <description>Memory access</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SLAVE</name>
                    <description>Memory access through AHB Slave and internally in the PKE.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MASTER</name>
                    <description>Memory access through AHB Master, outside the PKE.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CODERAM</name>
                <description>Code memory</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ROM</name>
                    <description>Code memory is a ROM.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAM</name>
                    <description>Code memory is a RAM.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLESMX</name>
                <description>State of DisableSMx input (high when SM2/SM9 operations are disabled).</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DISABLECLRMEM</name>
                <description>State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled).</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DISABLECM</name>
                <description>State of DisableCM input (high when counter-measures are disabled).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OPSIZE</name>
            <description>Operand size register.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPSIZE</name>
                <description>Operand size (number of bytes): 
					This register is used when the memory is accessed via AHB Master</description>
                <lsb>0</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPSIZE256</name>
                    <description>256 bytes.</description>
                    <value>0x0100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSIZE521</name>
                    <description>521 bytes.</description>
                    <value>0x0209</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSIZE2048</name>
                    <description>2048 bytes.</description>
                    <value>0x0800</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSIZE4096</name>
                    <description>4096 bytes.</description>
                    <value>0x1000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ECCERRORBITPOS</name>
            <description>ECC Error bit position register.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x03FF03FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORBITPOS1</name>
                <description>Position of error bit 1</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRORBITPOS2</name>
                <description>Position of error bit 2</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECCCONTROLSTATUSREG</name>
            <description>ECC Control and Status register.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAMEMCORRECTION</name>
                <description>Data Memory Correction flag, clear on write</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>DATAMEMFAILURE</name>
                <description>Data Memory Failure flag, clear on write</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CODEMEMCORRECTION</name>
                <description>Code Memory Correction flag, clear on write</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CODEMEMFAILURE</name>
                <description>Code Memory Failure flag, clear on write</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MICROCODEFORMAT</name>
            <description>Microcode Format register.</description>
            <addressOffset>0x078</addressOffset>
            <access>read-write</access>
            <resetValue>0xD4B79DDA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MICROCODEFORMAT</name>
                <description>Microcode format number.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HWVERSION</name>
            <description>Hardware Version register.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MINOR</name>
                <description>Minor version number.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJOR</name>
                <description>Major version number.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>IKG</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_IKG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x3000</addressOffset>
          <register>
            <name>START</name>
            <description>Start register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>START</name>
                <description>Start the Isolated Key Generation.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEEDERROR</name>
                <description>Seed Error during Isolated Key Generation.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ENTROPYERROR</name>
                <description>Entropy Error during Isolated Key Generation.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>OKAY</name>
                <description>Isolated Key Generation is okay.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CTRDRBGBUSY</name>
                <description>CTR_DRBG health test is busy (only when g_hw_health_test = true).</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CATASTROPHICERROR</name>
                <description>Catastrophic error during CTR_DRBG health test (only when g_hw_health_test = true).</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SYMKEYSTORED</name>
                <description>Symmetric Keys are stored.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PRIVKEYSTORED</name>
                <description>Private Keys are stored.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INITDATA</name>
            <description>InitData register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITDATA</name>
                <description>Writing a 1 initialise Nonce and Personalisation_String registers counters, i.e. start writing from the 32 LSB.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE</name>
            <description>Nonce register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCE</name>
                <description>Nonce (write/read value 32-bit by 32-bit).</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERSONALISATIONSTRING</name>
            <description>Personalisation String register.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PERSONALISATIONSTRING</name>
                <description>Personalisation String (write/read value 32-bit by 32-bit).</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESEEDINTERVALLSB</name>
            <description>Reseed Interval LSB register.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x80000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESEEDINTERVALLSB</name>
                <description>Reseed Interval LSB.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESEEDINTERVALMSB</name>
            <description>Reseed Interval MSB register.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESEEDINTERVALMSB</name>
                <description>Reseed Interval MSB.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PKECONTROL</name>
            <description>PKE Control register.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PKESTART</name>
                <description>Start the PKE operation or trigger for Secure mode exit.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CLEARIRQ</name>
                <description>Clear the IRQ output.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PKECOMMAND</name>
            <description>PKE Command register.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SECUREMODE</name>
                <description>Secure mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DEACTIVATED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVATED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SELECTEDKEY</name>
                <description>Select Generated Private Key for PKE operation.</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OPSEL</name>
                <description>Select PKE operation with Isolated Key</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PUBKEY</name>
                    <description>Public Key Generation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ECDSA</name>
                    <description>ECDSA Signature</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PTMUL</name>
                    <description>Point Multiplication</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
