NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_application.svd
            <register>
              <name>SYSCOUNTER</name>
              <description>Security configuration for SYSCOUNTERL/SYSCOUNTERH of GRTC</description>
              <addressOffset>0x07C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PRIVLATTR</name>
                  <description>PRIVLATTR feature</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unprivileged</name>
                      <description>Feature is available for Unprivileged usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Privileged</name>
                      <description>Feature is reserved for Privileged usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x10</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>INTERRUPT[%s]</name>
              <description>Description collection: Security configuration for interrupt n of GRTC</description>
              <addressOffset>0x080</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PRIVLATTR</name>
                  <description>PRIVLATTR feature</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unprivileged</name>
                      <description>Feature is available for Unprivileged usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Privileged</name>
                      <description>Feature is reserved for Privileged usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>COEXC</name>
            <description>Unspecified</description>
            <headerStructName>SPU_FEATURE_COEXC</headerStructName>
            <alternateCluster>DPPIC</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>CCCONF[%s]</name>
              <description>Description collection: Configuration of features for CCCONF[n] of COEXC</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PRIVLATTR</name>
                  <description>PRIVLATTR feature</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unprivileged</name>
                      <description>Feature is available for Unprivileged usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Privileged</name>
                      <description>Feature is reserved for Privileged usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>TURNAROUND[%s]</name>
              <description>Description collection: Configuration of features for TURNAROUND[n] of COEXC</description>
              <addressOffset>0x40</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PRIVLATTR</name>
                  <description>PRIVLATTR feature</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unprivileged</name>
                      <description>Feature is available for Unprivileged usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Privileged</name>
                      <description>Feature is reserved for Privileged usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CCMALLOW</name>
              <description>Configuration of features for CCMALLOW of COEXC</description>
              <addressOffset>0x80</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PRIVLATTR</name>
                  <description>PRIVLATTR feature</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unprivileged</name>
                      <description>Feature is available for Unprivileged usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Privileged</name>
                      <description>Feature is reserved for Privileged usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
